<script>
    import Post from '../../components/Post.svelte';

    let category = 'life';
    let title = '에너지 흐름의 방향';
    let create = '2022-01-11';
    let link = 'energy-flow-direction';
</script>

<Post {category} {title} {create} {link}>
    <p>
        세상에는 "에너지를 계속 소비하면 쓸 에너지가 없어
        충분히 비축해두어야 에너지를 잘 쓸 수 있는 댐 같은 존재"와
        "에너지를 계속 쌓아두면 고인물이 되어 잘 활용 못하고
        꾸준히 흘려 보내주어야 에너지를 잘 쓸 수 있는 강 같은 존재"가 있다.
        대학 시절 한 강사님이 이에 대한 이야기를 하시며
        전자는 내향형, 후자는 외향형 인간이라고 말씀하셨던 기억이 있다.
        내성적, 외향적 성격과는 별개의 에너지의 흐름이라나.
        그리고 나는 어느 쪽이냐고 묻는다면,
        내 에너지 흐름은 명백히 외향형이다.
    </p>
    <p>
        에너지가 흐르지 않은 채 방치되는 그 고인물 같은 감각이 너무 싫다.
        그 답답함이 날 더 아무것도 하지 못하게 하고,
        완전히 무기력해진다.
        자의로든 타의로든 다시 에너지를 흘려 보낼 때까지 그 상태가 유지되며
        고인물의 악순환이 이어진다.
        그리고 고인물이 충분히 씻겨 나간 후에야 비로소 난 일상생활이 가능해진다.
    </p>
    <p>
        휴식을 통한 회복...
        난 오래 휴식을 취한다고 해서 그 이후 활동에 대한 효율이
        높아지지는 않는 것 같다.
        어느 정도의 휴식은 물론 도움이 되지만
        그 "어느 정도"를 넘어서면 그 휴식은 시간을 흘려보낼 뿐
        그 어떤 유의미한 효과를 주지 못한다.
        게임에서 Active Point의 MAX 값이 정해져 있을 때,
        시간이 지나면서 서서히 Active Point가 회복되지만
        그 MAX 값에 도달하면 아무 일도 일어나지 않는 것과 비슷할까.
        아니, 그것은 정말 아무 일도 일어나지 않기라도 하지,
        솔직히 난 휴식이 지나치게 길어지면 에너지가 고인물이 되기 시작한다.
    </p>
    <p>
        그렇게 고여 있다보면 모든 게 가라앉고 침체되고
        우울해지는 것 같기도 하다.
        삶보다는 죽음과 더 근접해 있는 것 같다는 느낌을 받을 때도 있다.
        아무 것도 먹고 싶지 않고 그리고...
        절전모드에 진입하는 건지 무기력해진다.
    </p>
    <p>
        그래서일까, 집에 혼자 있다가도
        에너지를 분출하려는 특성이 있다.
        가만히 앉아서 작업하다가 목적 없이 집 안을 배회하기도 하고,
        괜히 막 움직인다.
        혼자 떠들기도 하고.
        그렇게 에너지를 순환시키면 무기력함도 덜 하고
        좀 살 만하더라.
        &#x1F440;
    </p>
</Post>