<script>
    import Post from '../../components/Post.svelte';

    let category = 'life';
    let title = '아무리 바빠도';
    let create = '2021-11-19';
</script>

<Post {category} {title} {create}>
    <p>
        "아무리 바빠도 이것만은 하자"라고 정해놓은 무언가가 있다면,
        그리고 이를 잘 실천할 수 있다면
        보다 나은 일상생활을 할 수 있는 것 같다.
        지치고 힘들어도, 모든 걸 다 내려놓고 싶다가도,
        이것 하나 붙잡고 있으면 다시 일상으로 돌아가는 것도 좀 더 수월한 것 같다.
        어쩌면 누군가에게는 종교가 이런 역할을 해주고 있는 게 아닌가 싶기도 하고.
    </p>
    <p>
        때로는 삶이 너무 힘들어서 이마저도 놓치게 되더라도,
        일상으로 돌아가고자 할 때 그 무언가를 시작으로 첫 발을 딛는다면
        이 또한 괜찮지 않을까.
        거기서부터는 다시 시작할 수 있지 않을까.
        그런 생각을 해본다.
    </p>
    <p>
        물론 그것이 무엇인지는 사람마다 다를 것이다.
        매일 특정 시간에 무언가를 할 수도 있고,
        매일 특정 분량의 무언가를 할 수도 있고,
        또 그 주기가 하루가 아닐 수도 있고,
        다양한 경우의 수가 있으리라.
    </p>
    <p>
        전공이나 직업과 유관한 훈련을 계획적으로 수행한다거나,
        아니면 짧은 일기를 써보는 것도 좋을 것 같다.
        개발자 혹은 그 지망생은 알고리즘 문제를 풀어볼 수도 있고,
        배우 혹은 그 지망생은 적당한 대본을 꺼내 낭독해볼 수도 있겠다.
        혹은 문필활동을 한다면 매일 적당한 주제 하나를 정해
        그것에 대한 글을 써본다거나.
        물론 꼭 그런 게 아니더라도
        악기 연습이나 외국어 공부 같은 것을 꾸준히 하는 것도
        삶에 있어서 유의미한 활동이 되리라.
    </p>
    <p>
        이러한 것들은 삶을 내던지지 않도록 하는 어떤 지표가 되면서도,
        쌓이고 보면 스스로에게 유의미한 발전을 가져도 주는 것일 수 있다.&#x1F33B;
    </p>
</Post>