<script>
    import Post from '../../components/Post.svelte';

    let category = 'life';
    let title = '코딩이 아닌 글쓰기로 잔디 심기';
    let create = '2021-11-10';
    let link = 'grass-planting';
</script>

<Post {category} {title} {create} {link}>
    <p>
        코딩을 통해 잔디를 심는 공간. 하지만 그곳에 글을 통해 잔디를 심기로 했다.
        물론 개발 블로그를 운영하며 잔디를 심는 사람도 있긴 하지만 난 개발과는 무관한 이야기로.
        그럴 거면 왜 굳이 GitHub이냐고 묻는다면, 글쎄. 사실 딱히 할 말은 없다.
        무언가를 써내려 갈 플랫폼 자체를 직접 구축하여 작성해보고 싶었다.
    </p>
    <p>
        내가 웹 개발자가 아닌 만큼 이 웹사이트는 상당히 어설프긴 할 것이다.
        어떤 부분은 비효율적으로 구현되어 있는 부분도 있을 것이다.
        jekyll이나 gatsby 등을 이용했다면 보다 나은 무언가가 만들어졌을지도 모르지만,
        그래도 난 그냥, 이렇게 해보고 싶었다.
    </p>
    <p>
        이 글을 쓰는 시점에도 난 이 웹사이트의 불안정성을 인정한다.
        아직 반응형 설계가 적용되지 않았으며, 굳이 따지자면 태블릿에 가장 적합한 상태다.
        PC 전체 화면에서는 좌우 여백이 더 있는 편이 낫고, 모바일은 안봐도 문제 있음을 알 수 있다.
        PC 기준도 모바일 기준도 아닌, 애매한 태블릿 언저리로 기본값을 설정한 건
        내가 PC 화면에서 절반만 채운 채로 보는 것을 선호하기 때문이다.
        좌우 분할 상태에서 작업하는 일이 많아, 일단 나 편한대로 구현하고 추후 개선하자, 라던가.
    </p>
    <p>
        생각해보면 효율성을 무시한 채 그저 내 마음이 이끄는대로,
        엄밀히 따지고 보면 합리적이지 못한 선택을 하는 경우가 상당히 많다.
        그 선택의 이유는 정말 순수하게, 단지 그러고 싶었을 뿐이다.
        제3자의 입장에서는 도저히 이해할 수 없을 만한 선택도 있었으리라.
    </p>
    <p>
        코딩이 아닌 글쓰기로 GitHub 잔디를 심는 건, 그래도 상대적으로 받아들여질 만한 것이라고 생각한다.
        물론 이를 부정한다면 뭐, 할 말은 없지만.
        사실 이 웹사이트 UI의 초안은 이렇지 않았는데, 역량 부족으로 설계가 일부 엎어졌다는 건 여담.
        가끔 코드도 뜯어 고치면 코딩으로 심어지는 잔디도 있긴 할 것이다.
        잔디를 무엇으로 심든 아무렴 어때, 라던가.
    </p>
    <p>
        백지보다는 좀 더 잔디밭 같아지면 "취미는 잔디 심기"를 주장해야지.
        그것이 어떻게 받아들여질지는, 글쎄.
        개발자들은 "취미는 코딩"으로 해석할 수도 있을 거고, 아무튼 그런 이야기.
        1차적으로 배포해보고 잔디가 심어지는 걸 보니 글을 쓰고 싶어져서 끄적이고 있지만
        역시 이 웹사이트, 건드릴 부분이 아직 많이 남아있다.
        한 동안은 코딩을 통한 잔디 심기도 꽤나 있을지도.
        여유가 될 때 조금씩 손봐야지.
        물론 이렇게 말해놓고 여유가 되어도 또 다음으로 미룰 수도 있다.
        이 글을 쓰고 있는 지금은... 한가하게 글을 쓰는 것 같지만 사실 생각보다 여유롭진 않다.
        생각해보면 참... 그닥 여유롭지도 않은 것 같은데 이런 걸 자체제작 하고 있다?
        이런 걸 가지고 스스로에게 뭐라 하는 것도 참 새삼스럽게 구는 거긴 하지만 말이다.
    </p>
    <p>
        아무튼 앞으로 가꾸어 나갈 잔디밭을 기대해본다.&#x1F331;
    </p>
</Post>
