<script>
    import Post from '../../components/Post.svelte';

    let category = 'life';
    let title = '쓰여지지 못한 글';
    let create = '2022-01-07';
    let link = 'incomplete-writing';
</script>

<Post {category} {title} {create} {link}>
    <p>
        무언가 쓰고자 하는 글이 생겼는데 쓸 여유가 없을 때,
        단지 키워드만 적어 놓아서는 무엇을 쓰고자 했는지 알 수 없더라.
        알아보는 것도 없진 않지만 매우 드물다.
        적어도 두어 문장의 끄적임은 남겨 두어야 떠올릴 수 있다.
        그렇게 적어놓은 문장들을 이어 써내려 간다.
        하지만 글이 완성되는 일은 그리 많지 않다.
        시간이 지난 뒤에 쓰는 글 중 반 이상은 방향을 잃고 사라진다.
        끝에 도달하지 못한 글은 말 그대로 사라져 버리고 만다.
        아무리 길게 써내려 간 글이라도, 그 가치를 잃어버린다면.
    </p>
    <p>
        글의 가치를 논한다는 것.
        글쎄, 뭘까.
        누군가는 모든 글에는 나름의 가치가 있다고 주장하기도 한다.
        나는, 글쎄.
        이야기를 써내려 가다 그저 구구절절한 주저리가 되어 버리면
        그 종이를 그대로 고이 접어 종이 쓰레기로 보내 버리곤 한다.
        다른 사람에겐 어떨지 몰라도 나에게 나의 그런 글은 아무 가치 없기에.
        몇 문장, 혹은 몇 문단 쳐내는 걸로 안되겠다 싶으면
        그 동안 끄적였던 모든 것들을 한 번에 날려 버리는 것이다.
    </p>
    <p>
        유의미한 무언가가 나올 것 같던 주제에 대해서도
        쓰다보면 그저 반복적으로 같은 말만 하고 있다는 느낌에
        글을 쓰는 것을 그만두기도 한다.
        글은 어느 정도는 타이밍인 것 같다.
        그래서 토마스 위버가 앨빈 켈비에게 그랬던 걸까, 싶기도 하고.
    </p>
    <p class="quote">
        느낌이 온다면 앨빈 시작인 거야<br>
        스쳐가는 요만한 아이템 이걸 하나 잡는 거야<br>
        그러다 글빨이 착착 오르게 되고 이게 바로 창조의 예술<br>
        이제 시작이야<br>
        자 이 때 잡지 못하게 되면 사라져 버려<br>
        뭔가 나올 때까지만 좀 기다려 시간을 줘<br>
        딱 꽂혔을 때 가만히 생각을 해봐 뭐라도 적어놔야 하는데<br>
        ― Here's Where It Begins, &lt;스토리 오브 마이 라이프&gt;
    </p>
    <p>
        무언가 쓰고자 하는 글이 생겼는데 쓸 여유가 없을 때,
        '이런 글 써야지' 하고 넣어두었다 나중에 쓰려고 하면
        잘 써지지 않는 경우가 많다는 것.
        지금 이 순간에도 지난 달에 적어 놓은 두어 가지 주제를 던져 놓고
        A4지 두 페이지 반 정도 분량의 끄적임을 뒤로 등진 채
        또다른 이야기를 써내려 가고 있다.
        그것들을 붙잡고 있어봤자
        원래 쓰고자 했던 무언가는 나오지 않고
        주제를 물고 늘어지는 문장의 연속일 뿐이라는 것을 나는 안다.
    </p>
    <p>
        그런 의미에서 무언가에 딱 꽂혔을 때
        글을 쓸 수 있는 상황이라면 참 좋을텐데 싶다.
        시간을 멈춰 놓고 나 혼자 이야기를 써내려 간 뒤
        시간이 다시 흐르도록 할 수 있다면.
        하지만 우린 그 찰나의 순간을 찰나의 순간으로 보낸 채
        언젠가 적당한 시간이 나길 기다려야 한다.
        그 찰나의 순간에 느낀 무언가가 얼마나 남아있을진 알 수 없지만.
        &#x1F4DD;
    </p>
</Post>