<script>
    import Post from '../../components/Post.svelte';

    let category = 'life';
    let title = '약속';
    let create = '2021-12-23';
    let link = 'promise';
</script>

<Post {category} {title} {create} {link}>
    <p class="quote">
        약속[約束]<br>
        할 것과 하지 않을 것, 그것에 대한 선언.<br>
        ― Bare the Musical
    </p>
    <p>
        살다보면 종종 약속인지 아닌지 모호한 무언가를 마주치곤 한다.
        기약 없는 "언제 밥이나 먹자" 류의 이야기가 그러하다.
        그것을 약속의 시작으로 여기는 이와
        별 의미 없이 스쳐 지나가는 말로 여기는 이가
        골고루 섞여 있다.
        말하는 이와 듣는 이의 인식이 동일하다면 문제 없지만
        서로 다를 경우에는 상황이 애매해진다.
    </p>
    <p>
        그래서 나는 그런 류의 이야기들을 꺼려하는 경향이 있다.
        약속으로 여기고 고려해야 하는지
        그냥 스쳐 지나가는 말로 넘겨야 하는지
        같은 말이라도 누가 언제 어떤 맥락에서 하냐에 따라
        약속 여부가 달라지기도 한다.
        그리고 그것을 판단하기란 쉽지 않은 일이다.
    </p>
    <p>
        다양한 일화들을 들어보면 이게 참 미묘하다.
        누군가는 약속을 잡으려 하였으나
        상대가 그냥 인사치례로 넘겨 버려서 시무룩 하고,
        누군가는 그냥 가볍게 한 말이었는데
        상대가 진짜 일정을 잡으려 한다며 귀찮아 한다.
        난 그런 이들을 바라보며... 판단을 보류한다.
    </p>
    <p>
        그래서 "공연 보러 갈게"는
        인사치례일까 진짜 보러 온다는 걸까.
        공연 및 할인 정보를 안내하며 관극 일정을 체크해야 하는지
        올거면 오고 말거면 말겠지 하고 신경쓰지 말아야 하는지
        그게 참 쉽지 않은 일이다.
        그래서 난 주로 후자의 태도로 일관하고 있긴 하지만.
    </p>
    <p>
        제발... 약속을 할 거면 확실하게 하고
        아닌거면 빈말로도 안했으면 좋겠다는 소소한 바람.
        &#x23F2;
    </p>
</Post>