<script>
    import Post from '../../components/Post.svelte';

    let category = 'life';
    let title = '책임과 권한';
    let create = '2022-03-04';
    let link = 'responsibility and authority';
</script>

<Post {category} {title} {create} {link}>
    <p>
        어떠한 일을 수행함에 있어서 책임과 권한이 누구에게 있는가 하는 것은
        꽤나 중요한 일일 수 있다.
        내가 하는 작업에 대하여 그 책임과 권한이 나에게 있을 때와 그렇지 않을 때
        내가 그 일을 대하는 태도는 달라질 수 밖에 없으니 말이다.
        누군가는 책임과 권한으로부터 자유로울 때
        이에 대한 부담이나 복잡한 고민 없이 주어진 일을 수행할 수 있어 편하다는 사람도 있을 것이며,
        또 누군가는 책임은 없고 권한만 있으면 좋겠다고(...) 생각하는 사람도 있을 것이다.
        그리고 또 누군가는 자신이 책임과 권한을 가지고 있을 때
        본인이 추구하는 방향으로 쉽게 끌고 갈 수 있어 편하다고 생각할 것이다.
        권한 없이 책임만 갖고자 하는 이는... 글쎄, 있나?
        가끔 윗사람이 책임은 내가 질테니 권한을 넘기겠다 같은 발언을 하기는 하는 것 같은데
        사실 잘 모르겠다.
    </p>
    <p>
        나는 기본적으로 책임과 권한을 모두 가지고 작업하는 것을 선호한다.
        나에게 책임과 권한이 주어지지 않은 일에 대해서는 주저하고 머뭇거리게 되기에.
        이대로 흘러가도 될 것인가.
        책임과 권한을 가진 자가 곁에 있다면 어느 정도 물어가며 진행할 수는 있겠지만
        아무래도 한계가 있다는 걸 안다.
        어느 정도 범위까지 물어볼 것이며 어느 정도 범위까지 내 판단으로 수행해야 하는가.
        그리고 얼마나 자주 물어보는 것까지 상대를 부담스럽게 하지 않을 수 있는가.
        여러 가지 고민 속에 갈피를 잡지 못하고 결국 시키는 것 이상의 무언가는 할 수 없게 된다.
    </p>
    <p>
        내가 나의 의지와 나의 판단으로 무언가를 수행하기 위해서는 나에게 충분한 권한이 필요하다.
        그리고 권한에는 책임이 뒤따라야 한다.
        책임 없는 권한은 온전한 형태의 권한이 될 수 없다.
        책임을 누군가에게 떠넘기면 그것은 갑질이 될 수 있고,
        그 누구도 책임을 가지고 있지 않다면 그것은 위태로운 작업이 될 것이다.
        가끔 나보다 큰 권력을 가진 이가 책임은 유지한 채 권한만 넘겨주는 경우가 있을 수 있는데,
        이 경우 모든 판단에 있어서 그 책임을 가진 이를 눈치보게 되므로
        나의 권한을 온전히 활용할 수 없게 된다.
    </p>
    <p>
        책임과 권한을 가진 채 작업하는 게 편하다는 것을 처음 인지한 건 아마 대학생 때일 것이다.
        당시 나는 팀프로젝트에서 아키텍트로서 활동하는 일이 많았고,
        그 시간 속에서 무의식 중에 몸에 베인 것들이 있으리라.
        이제와서는 누군가 나에게 무언가를 부탁할 때도
        그 사람이 책임과 권한을 유지한 채 나에게 업무를 맡겼다기 보다는
        책임과 권한째로 하청을 맡겼다고 생각하는 편이 작업하기 편하더라.
        그저 전달받은 요구사항만 잘 충족한다면 그 외의 영역에 대해서는 나에게 책임과 권한이 있는 것이다.
        무언가 잘못되더라도 책임을 가진 상대에게 미안해 어쩔줄 몰라 하는 것보다
        내 책임을 인정하고 이 권한을 이용해 상황을 대처해나가는 편이 더 나은 방향으로 흘러가는 것 같기도 하고.
        &#x1F440;
    </p>
</Post>