<script>
    import Post from '../../components/Post.svelte';

    let category = 'life';
    let title = '재촉한다는 것';
    let create = '2021-12-02';
    let link = 'urge-to-do-quickly';
</script>

<Post {category} {title} {create} {link}>
    <p>
        살다보면 누군가에게 무언가를
        재촉해야 하는 상황이 있을 수 있다.
        하지만 나는 누군가를 재촉하는 일이
        내 당연한 권리를 주장하는 경우조차
        상대방에게 무언가를 강요하는 느낌이 들어
        불편하게 느껴지곤 한다.
        그럼에도 불구하고
        한두 번 요청하는 것으로는 이루어지지 않아
        결국에는 재촉해야만 하는 일이 벌어지곤 한다.
    </p>
    <p>
        왜 그런 일이 발생해야만 했는가.
        글쎄, 나로선 알 수 없는 일이다.
        지금 이 순간에도
        누군가의 작업을 기다리거나 재촉해야 할 일이
        두어 가지 정도 남아있는데
        사실 재촉하기도 지쳤다.
        상대가 "다음주에"를 주장한지 2주가 넘은 일은,
        이제 와서는 알게 뭐야, 하는 취급을 받고 있고,
        몇 개월째 대기 중인 일은, 글쎄,
        이건 내가 눈치도 주고 한 번 재촉을 하긴 했었는데
        상황이 달라지지 않아 반쯤 포기했다.
        이렇게 내려놓다보면
        인간에 대한 신뢰도가 떨어진다는 점이
        문제라면 문제지만.
    </p>
    <p>
        난 기본적으로 느긋한 인간이다.
        당장 급하게 필요한 게 아니라면
        배송에 한 달이 넘게 걸리더라도 상관 없을 만큼.
        솔직히 당일 배송보다는
        프로젝트 일정에 따라
        잊혀질 때쯤 배송되기도 하는 크라우드 펀딩이
        더 익숙하다.
        그런 내가 재촉해야 한다는 느낌을 받는다면
        상대방은 얼마나 일처리를 안하는 건가 싶기도 하고.
    </p>
    <p>
        물론 각자의 사정이 있다는 건 이해한다.
        다른 바쁜 일이 있을 수 있고,
        우선순위에 밀려 다음으로 미루고 있을 수도 있고,
        다양한 경우의 수가 있을 수 있다.
        그걸 이해하기에 왠만하면
        재촉하기보다는 기다리려고 한다.
        다른 일로 바쁘고 정신 없을 때 재촉해봐야
        상대에게 스트레스와 압박감만 줄 뿐,
        상황이 나아지기는 쉽지 않다는 걸 안다.
    </p>
    <p>
        그래도 정도가 있지 싶다가도,
        이제 와서는 모르겠다.
        아무런 판단도 하고 싶지 않다.
        이 상황에서 내가 내릴 수 있는 판단은
        상대에 대한 부정적인 인식뿐이지만,
        그러고 싶지는 않다.
        그래도 언제까지나 가만히
        기다리고만 있을 수는 없는데, 하며.
        또 그 어떤 답도 찾지 못한 채 시간이 흘러간다.
        &#x231B;
    </p>
</Post>