<script>
    import Post from '../../components/Post.svelte';

    let category = 'life';
    let title = '글쓰기';
    let create = '2022-06-10';
    let link = 'writing';
</script>

<Post {category} {title} {create} {link}>
    <p>
        "글 잘 쓰고 싶다." 많은 이들이 하는 생각이다.
        하지만 그 막연한 "글 잘 쓰고 싶다"는 무엇일까.
        글이라고 해도 시 다르고 소설 다르고 에세이 다르고...
        문학뿐만 아니라 지원서나 보고서의 글도 글은 글이다.
        그들이 말하는 "글 잘 쓰고 싶다"의 '글'은 무엇일까. 그 모든 글?
        물론 공통적인 부분도 있긴 할 것이다.
        어떤 글이냐에 따라 필요한 역량이 다르고 형식이 다르겠지만
        공통 역량이 있고, 그걸 기반으로 각각의 형식에 맞게
        필요에 따라 추가로 개발한다면, 영 불가능한 일은 아닐 것이다.
    </p>
    <p>
        하지만 그 모든 형식의 글을 섭렵하는 게 진정한 목표점인가.
        그건 생각해 볼 문제다.
        우리가 가진 시간, 노력, 에너지, 그 모든 것은 무한하지 않기에
        선택과 집중이 필요하다.
        아주 오래 걸리더라도 모든 영역을 동시에 해내겠다고 하면 할 말은 없지만.
        모든 영역을 노린다고 해도 어느 정도는
        내가 어떤 글을 쓸 것인지에 따라 우선순위를 부여하는 편이 좋지 않을까.
    </p>
    <p>
        10대 시절의 나는 시와 소설에 관심을 가지고 있었다.
        10대 중후반의 흔적 속에는 어설픈 시와
        쓰여지지 못한 소설의 설정이 여럿 존재한다.
        그리고 그들은 그 과거에 머물러 있다.
        쓰여지지 못한 소설의 설정(사실 당시에는 만화에도 관심을 가지고 있었기에
        소설이 될지 만화가 될지 알 수 없는 설정이었지만)을 가끔
        풀어보고 싶기도 하지만, 글쎄.
        그것은 나중을 기약하기로 하겠다.
        어쩌면 내가 아닌 다른 누군가의 글을 통해 세상에 나오게 될지도 모르지.
        10대 후반에는 다른 이들과 공유된 세계관에 대한 로망도 있었는데,
        내 삶에서 그런 것은 실현되지 않았지만 굳이 유사한 무언가를 언급하자면
        H. P. 러브크래프트와 크툴루 신화를 이야기할 수 있겠다.
        그런 공유된 세계관이 구축된다고 할 때
        소설은 뒷전으로 미룬 현재의 내가 참여하게 될지는 알 수 없지만.
    </p>
    <p>
        그렇다. 소설은 뒷전으로 미룬.
        이제 와서는 시나 소설보다는 에세이에 가까운 무언가를 쓰곤 한다.
        그리고 지원서, 보고서 등 공적인 문서를 잘 쓰는 것에 관심이 생겼다.
        솔직히 어느 정도는, 소설에 대한 회의감 같은 것도 있다.
        내가 어떤 소설을 써냈을 때 이 세상에는 높은 확률로
        비슷한 주제의 비슷한 울림을 주는 작품이 이미 존재하는데
        그것은 내 글보다 훨씬 잘 쓰여져 있다.
        내가 그걸 인용하기 보다는 새로 작성하는 게 얼마나 의미가 있을까.
        물론 전혀 의미 없는 일은 아니고 그렇게까지 회의적일 필요는 없을 수도 있다.
        하지만 나로 하여금 소설에 대한 우선순위를 떨어뜨리게 하는 데에는 충분했다.
        그럼에도 불구하고 이어나가는 자가 작가를 하는 거지.
        나는 (무라슈키나의 말을 빌려) 나름의 문필 활동을 하고 있지만,
        그렇다고 나 자신을 작가라고 부를 생각은 없다.
    </p>
    <p>
        어쩌면 나에게 시간, 노력, 에너지, 그 모든 것에 충분한 여유가 있었다면,
        나는 여전히 시를 쓰고, 소설을 쓰며, 만화도 그리고 있었을지도 모른다.
        하지만 그 모든 것은 한정되어 있고, 내 삶에서 문필 활동은 주가 되지 않으며,
        (앞으로도 그럴 거라는 장담은 할 수 없지만 아무튼 현재로서는 그렇다는 것이다)
        그렇기에 이 분야에서는 선택과 집중으로,
        내가 쓰고자 하는 글 위주로 개발하고자 한다.
        &#9997;&#65039;
    </p>
</Post>