<script>
    import Post from '../../components/Post.svelte';

    let category = 'trace';
    let title = '연기 공학';
    let create = '2020-09-05';
    let link = "act-engineering";
</script>

<style>
</style>

<Post {category} {title} {create} {link}>
    <p>
        그래, 지금 상태는
        "리팩토링이 필요한, 작동하는 코드".
        실행하는 데는 문제가 없다.
        잘 작동하고, 유닛 테스트를 통과한다.
        하지만 충분히 개선의 여지가 있다.
        더 나은 구현체가 있는데, 아직 도달하지 못했다.
    </p>
    <p>
        그리고 유닛 테스트는 통과하더라도
        우리가 함께 써내려 가는 이야기는
        개별 유닛에 대한 테스트뿐만 아니라
        시스템 테스트도 고려할 필요가 있다.
        전체 시스템이 잘 작동하는가.
        유닛 테스트 상에는 문제가 되지 않지만
        다른 유닛과의 상호작용을 다루는 시스템 테스트에서
        마가 뜬다거나, 다른 유닛의 태스크를 방해한다거나
        그래, 얼마든지 있을 수 있는 법이지, 신경써야 한다.
    </p>
    <p>
        '단휘'가 아닌 다른 유닛은 Permission Denied이니
        이 유닛 내에서의 리팩토링이 필요하다.
        여건이 된다면 다른 유닛과의 시스템 테스트도 수행하고.
        그리고 중요한 건,
        우린 인터프리터가 아니라 컴파일러다.
        작성된 코드를 실행할 때마다 실행 가능한 형태로 만드는 게 아니라
        미리 컴파일을 통해 실행 파일을 생성한다.
        이것이 바로 체화다.
        컴파일 및 최적화에 걸리는 시간도 고려하여 구현해야지.
        런타임 에러를 발생시키는, 불완전한 실행 파일보다는
        현재의 개선이 필요하지만 작동은 잘 하는 실행 파일이
        훨씬 더 좋은 것이다.
    </p>
    <p>
        이게 참 재밌다.
        고대 그리스에서 그러했듯이
        예술과 공학은 많이 닿아 있는 것을 느낀다.
        가끔 선생님의 설명도 공학적으로 재구성하여 이해하곤 한다.
        사실 비전공자라는 것에 위축되어 있던 때가 있었다.
        하지만 이제는, 백금은 백금이고 단휘는 단휘다.
        &#x1F3AD;
    </p>
    <p class="quote">
        &#x1F517; <a href="https://www.facebook.com/danhwi.jung/posts/1608456609332818">페이스북 게시물</a>에서 발췌
    </p>
</Post>