<script>
    import Post from '../../components/Post.svelte';

    let category = 'trace';
    let title = 'Deux, <Message>';
    let create = '2021-02-19';
    let link = 'link';
</script>

<Post {category} {title} {create} {link}>
    <p class="quote">
        위로 위로 올라갈수록 아래보다 위가 더 멀어보이고<br />
        ― Deux, &lt;Message&gt;
    </p>
    <p>
        이 노래를 처음 들었을 땐 그냥 별 생각 없었는데, 어느날부터인가 이 구절이 와닿기 시작했다.
    </p>
    <p>
        정말 뭣도 모르던 노베이스 시절에는 무엇이 문제고 어떻게 해야 잘 할 수 있는지 알지 못했기에 스스로의 문제를 파악하지 못했고, 그저 안일하게 생각했다.
        그런데 점점 알아갈수록, 배워갈수록, 답이 될 수 없는 것과 답이 될 수 있는 것, 그리고 그것이 구분되는 그 기준을 깨달을수록, 정말 위로 올라갈수록 나에겐 갈 길이 멀게 느껴졌다.
    </p>
    <p>
        어떤 분야든 그런 것 같다. 전공 쪽에서도 주변의 학부생들은 날 높게 평가하지만 난 더 큰 무대를 바라보며 부족함을 느낀다.
        연기도 분명 처음 시작했을 때보다 확실히 는 건 알겠는데 더 훈련되어야 할 게 많이 보인다.
    </p>
    <p>
        여기서 중요한 건, 한 걸음씩 꾸준히 나아가는 것 같다. 가야 할 길이 멀어 보인다고 주눅들거나 겁먹고 멈춰서지 말고, 그 먼 길을 조금씩 걸어가는 것.
        어떻게 보면 그 길이 멀어보이는 건 그 만큼의 목표가 보인다는 것. 목표도 방향도 찾지 못한 채 헤매는 것보다 훨씬 좋은 상황이지 않을까?&#x1F3B5;
    </p>
    <p class="quote">
        &#x1F517; <a href="https://www.facebook.com/danhwi.jung/posts/1746174295561048">페이스북 게시물</a>에서 발췌
    </p>
</Post>