<script>
    import Post from '../../components/Post.svelte';

    let category = 'trace';
    let title = '2학년 9반의 미스테리';
    let create = '2015-04-14';
    let link = 'mystery-of-grade-2-class-9';
</script>

<Post {category} {title} {create} {link}>
    <p>
        오늘이 끝나도록 풀리지 않은 한 미스터리 사건을 기록한다.
        사건의 발단은 어제, 월요일 방과 후.
        2학년 9반 교실에서 지리 올림피아드를 마친 후의 일이다.
    </p>
    <p>
        문을 잠그고 복도를 지나가던 담당 선생님은
        과학 교과 교실이 정리되어 있지 않은 것을 발견한다.
        과학 교과 교실도 지리 올림피아드 때 이용했기 때문에
        정리해야 한다고 판단한 담당 선생님은
        2학년 9반의 출석부를 창틀에 두고 정리를 시작한다.
    </p>
    <p>
        정리를 마친 후 과학 교과 교실에서 나온 담당 선생님은
        출석부가 사라졌음을 인지한다.
        그는 교무실에 가보았으나
        보관함에는 2학년 9반의 출석부가 존재하지 않았다.
        걱정스러운 마음에 그곳에 있는 9반 학생에게 물어보았더니,
        교실에 남아 공부하는 아이들이 있다면
        그 아이들이 석식 먹으러 갈 때 가져갔을 수도 있다고 대답하여
        일단 안심했다.
    </p>
    <p>
        여기까지가 월요일의 이야기.
    </p>
    <p>
        그리고 그 다음 날.
        나는 언제나처럼 등교 직후 교무실로 갔다.
        선도부 활동이 있는 날을 제외하면 항상 제일 먼저 오니 말이다.
    </p>
    <p class="quote">
        교무실에 학급별 출석부가 보관되어 있고,
        출석부에는 교실 열쇠가 붙어 있다.
        보통 맨 처음 등교하는 학생이 교무실에서
        본인 학급 출석부를 가져와 문을 연다.
        선도부는 부원들 중 두 명씩 돌아가며 활동하던 것으로 기억하는데,
        그들은 다른 학생들보다 일찍 등교해야 했으므로
        본인 활동일에는 그 학생이 해당 학급 교실 문을 열 확률이 높다.
    </p>
    <p>
        그러나 그곳에는 출석부가 없다.
        선도부인가, 하고 생각하며 나는 교실로 향한다.
        하지만 그곳에 있는 것은 잠겨 있는 문.
        나는 혹시 다른 칸에 꽂혀 있지는 않을까 하는 생각에
        다시 교무실에 가보았으나 그렇지 않았다.
        해서 나는 담임 선생님께서 계신 2학년부실에 가보았는데
        담임 선생님은 계시지 않고,
        그 분을 찾는 이유를 물어보신 전영희 선생님과
        교무실에 다시 가보았다.
    </p>
    <p>
        출석부가 확실히 없는 것을 확인한 후
        우리는 지리 올림피아드 담당 선생님을 찾아갔다.
        그리고 결국에는 행정실에서 비상용 열쇠를 꺼냈다.
        그 열쇠를 가지고 교실로 간 우리는
        두 학생이 문 앞에서 기다리고 있는 것을 발견한다.
        열쇠로 문을 열고 들어간 우리는 엄청난 것을 발견한다.
    </p>
    <p>
        교탁 위에 출석부가 있는 것이다.
        출석부에는 정상적으로 열쇠가 다려 있다.
        창문은 모두 잠겨 있다.
        뒷문은 연수가 확인하러 가서 그 때 열었다.
        즉, 원래는 잠겨 있었다.
        열 수 있는 창문이라고는 복도 반대편,
        바깥을 향한 창문뿐이었다.
        그 와중에 교탁 위에 가지런히 놓여 있는 출석부.
    </p>
    <p>
        분명 담당 선생님께서는 잠그고 나가셨다.
        그리고 누군가 창틀에 출석부가 있어 가져다 주었다고 해도
        보통은 교무실에 가져다두지 않는가.
        게다가 굳이 이러한 밀실을 만들어낼 필요는 없지 않은가.
    </p>
    <p>
        CCTV도 없어 이 미스테리한 사건의 전말을 알 수 없다.
        하지만 확실한 것은 한 가지.
        내가 이것 때문에 아침에 십 몇 분동안이나 교내를 돌아다녔다.
        누군지는 몰라도 범인은 나로 하여금 운동을 하게 하였다.
        참으로 고맙구나.
        하...
        &#x1F914;
    </p>
</Post>